#include "school.h"

void login()//登录审查
{
    int acc;//账号
    int pss;//密码
    printf("*********************************\n");
    printf("示例账号1：1234 示例密码1:1234（学生账号）示例账号2：2023 示例密码2:2023（教工账号）\n");
    printf("*********************************\n");
    printf("请输入账号：\n");
    scanf("%d",&acc);
    printf("*********************************\n");
    printf("请输入密码：\n");
    scanf("%d",&pss);
    if((acc == 1234) &&(pss == 1234))
    {
        printf("*********************************\n");
        printf("欢迎你，学生1234！\n");
        printf("*********************************\n");
        permission = 1;
    }
    else if((acc == 2023) &&(pss == 2023))
    {
        printf("*********************************\n");
        printf("欢迎你，老师2023！\n");
        printf("*********************************\n");
        permission = 0;
    }
    else
    {
        printf("*********************************\n");
        printf("账号或密码错误！\n");
        printf("*********************************\n");
        login();
    }
}
