#include "school.h"

void welcome_1()//总菜单
{
    printf("*\t西北工业大学行政一网通\t*\n");
    printf("*********************************\n");
    printf("*\t信息多跑腿,线下少跑腿\t*\n");
    printf("*\t为完成\"126\"工程而奋斗!\t*\n");
    printf("*********************************\n");
    printf("*\t请选择您要办理的项目\t*\n");
    printf("*\t1.宿舍管理系统\t\t*\n");
    printf("*\t2.退出账号\t\t*\n");
    printf("*********************************\n");
}

void welcome_2()//学生信息
{
    printf("*\t西北工业大学学生中心\t*\n");
    printf("*********************************\n");
    printf("*\t请选择您要办理的项目\t*\n");
    printf("*\t1.录入学生信息\t\t*\n");
    printf("*\t2.打印学生信息\t\t*\n");
    printf("*\t3.统计学生人数\t\t*\n");
    printf("*\t4.查找学生信息\t\t*\n");
    printf("*\t5.修改学生信息\t\t*\n");
    printf("*\t6.删除学生信息\t\t*\n");
    printf("*\t7.返回上一级菜单\t*\n");
    printf("*********************************\n");
}
